36-jwt-auth/server/app/controllers/api/v1/auth_controller.rb

    def create
        # authenticate the user
        #
        user = User.find_by(username: params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Charles"], ["LIMIT", 1]]