36-jwt-auth/server/app/controllers/api/v1/users_controller.rb

  def create
  #  create a new User instance
  user = User.new(user_params)
    if user.valid?
      user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"